# WallThickness

## Description
Returns the thickness of walls that meet the criteria.

```pascal
FUNCTION WallThickness(c : CRITERIA) : REAL;
```

```python

def vs.WallThickness(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA||

## Version
Availability: from VectorWorks12.0
## Category
* Criteria